# Rebar Crank Type Utils Set Crank Offset Multiplier Method

Source: https://www.revitapidocs.com/2026/30b20a3e-e8ac-8afa-c82a-25580d4c0810.htm

---

| Rebar Crank Type Utils Set Crank Offset Multiplier Method |
| --- |

Sets the crank offset multiplier value.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static void SetCrankOffsetMultiplier(
	Document document,
	ElementId rebarCrankTypeId,
	double crankOffsetMultiplier
)
```

```
Public Shared Sub SetCrankOffsetMultiplier (
	document As Document,
	rebarCrankTypeId As ElementId,
	crankOffsetMultiplier As Double
)
```

```
public:
static void SetCrankOffsetMultiplier(
	Document^ document,
	ElementId^ rebarCrankTypeId,
	double crankOffsetMultiplier
)
```

```
static member SetCrankOffsetMultiplier :
        document : Document *
        rebarCrankTypeId : ElementId *
        crankOffsetMultiplier : float -> unit
```

#### Parameters

document Document
:   The document.

rebarCrankTypeId ElementId
:   The Rebar Crank Type id.

crankOffsetMultiplier Double
:   The crank offset multiplier value.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | The rebarCrankTypeId doesn't represent a valid Rebar Crank Type. It should be an ElementType of BuiltInCategory.OST\_RebarCrankType category. |
| ArgumentNullException | A non\-optional argument was null |
| ArgumentOutOfRangeException | The given value for crankOffsetMultiplier must be positive. |

See Also

#### Reference

RebarCrankTypeUtils Class Autodesk.Revit.DB.Structure Namespace